{
  "backend/main.mo": "Motoko backend implementing products, offers, enquiries, contact info, and user profiles with access‑controlled admin/user operations and blob storage integration.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, and test IDs with confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend files including pages, components, hooks, and utilities.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router for public and admin routes with separate layouts and automatic router switching based on URL.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown to non-admin users with logout and navigation options.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard enforcing Internet Identity authentication and admin status, showing loaders or access-denied UI as needed.",
  "frontend/src/components/enquiry/EnquiryDialog.tsx": "Modal dialog for submitting product enquiries with form fields, success message, and async submission handling.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with brand info, contact details, quick links, and WhatsApp integration.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with brand title, desktop and mobile navigation, and a toggleable mobile menu.",
  "frontend/src/components/offers/OfferBannerSlider.tsx": "Auto-rotating banner slider displaying offer images or fallback banners with navigation controls.",
  "frontend/src/components/products/ProductCard.tsx": "Displays a product card with image, price, badges, metadata, and options to order via WhatsApp or open an enquiry dialog.",
  "frontend/src/components/products/ProductFilters.tsx": "Filter sidebar allowing users to sort, filter by attributes, and adjust price range based on available products.",
  "frontend/src/components/ScrollReveal.tsx": "React component that animates children into view using IntersectionObserver for fade-and-slide reveal effects.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminStatus.ts": "Checks whether the current authenticated user is an admin using the actor’s isCallerAdmin method.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state management via AuthClient in a React context.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls into React Query hooks for products, offers, contact info, and enquiry submission.",
  "frontend/src/index.css": "Defines Tailwind base styles and luxury-themed color variables, gradients, components, and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin home page providing navigation to product, offers, contact, and enquiries management sections.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Handles Internet Identity login flow for admins and redirects authenticated admins to the dashboard.",
  "frontend/src/pages/admin/ContactAdminPage.tsx": "Placeholder page for managing business contact information.",
  "frontend/src/pages/admin/EnquiriesAdminPage.tsx": "Placeholder page for viewing and managing customer enquiries.",
  "frontend/src/pages/admin/OffersAdminPage.tsx": "Placeholder page for administering promotional offers and banners.",
  "frontend/src/pages/admin/ProductsAdminPage.tsx": "Placeholder page for managing products in the admin panel.",
  "frontend/src/pages/CollectionPage.tsx": "Displays the product collection with filters, loading states, and animated product cards.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact details and a form that submits enquiries using backend queries, with loading and success handling.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying hero banner, features, and sections for new and featured products fetched from the API.",
  "frontend/src/pages/OffersPage.tsx": "Loads current offers and discounted products, showing a banner slider and a grid of sale items.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays full product details with image gallery, size selection, tailoring notes, and WhatsApp ordering.",
  "frontend/src/utils/format.ts": "Utility functions for formatting dates, relative dates, and AED prices.",
  "frontend/src/utils/productFiltering.ts": "Implements product filtering and sorting plus helpers for extracting available sizes and colors.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters (including hash routes), storing them in sessionStorage, retrieving them, and clearing them from URL or storage.",
  "frontend/src/utils/whatsapp.ts": "Generates WhatsApp message links and predefined product/general inquiry messages for ordering abayas.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, fonts, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the boutique website’s purpose, design notes, features, and required images."
}